In [1]:
import pandas as pd
house = pd.read_csv(r"D:\2025 단축키 빅데이터분석기사_파이썬\작업형 제1유형\data\housing.csv")
print(house.head(3))

   longitude  latitude  housing_median_age  total_rooms  total_bedrooms  \
0    -122.23     37.88                  41          880           129.0
1    -122.22     37.86                  21         7099          1106.0
2    -122.24     37.85                  52         1467           190.0

   population  households  median_income  median_house_value ocean_proximity
0         322         126         8.3252              452600        NEAR BAY
1        2401        1138         8.3014              358500        NEAR BAY
2         496         177         7.2574              352100        NEAR BAY

In [3]:
print(house.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20640 entries, 0 to 20639
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           20640 non-null  float64
 1   latitude            20640 non-null  float64
 2   housing_median_age  20640 non-null  int64
 3   total_rooms         20640 non-null  int64
 4   total_bedrooms      20433 non-null  float64
 5   population          20640 non-null  int64
 6   households          20640 non-null  int64
 7   median_income       20640 non-null  float64
 8   median_house_value  20640 non-null  int64
 9   ocean_proximity     20640 non-null  object
dtypes: float64(4), int64(5), object(1)
memory usage: 1.6+ MB
None

In [7]:
print(house.isna().sum())

longitude               0
latitude                0
housing_median_age      0
total_rooms             0
total_bedrooms        207
population              0
households              0
median_income           0
median_house_value      0
ocean_proximity         0
dtype: int64

In [9]:
house_dropna = house.dropna()

In [11]:
house_dropna.isna().sum()

longitude             0
latitude              0
housing_median_age    0
total_rooms           0
total_bedrooms        0
population            0
households            0
median_income         0
median_house_value    0
ocean_proximity       0
dtype: int64

In [17]:
int(len(house_dropna) * 0.7)

14303

In [19]:
house_dropna_70 = house_dropna.iloc[:int(len(house_dropna)*0.7)]

In [23]:
house_dropna_70.info()

<class 'pandas.core.frame.DataFrame'>
Index: 14303 entries, 0 to 14440
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           14303 non-null  float64
 1   latitude            14303 non-null  float64
 2   housing_median_age  14303 non-null  int64
 3   total_rooms         14303 non-null  int64
 4   total_bedrooms      14303 non-null  float64
 5   population          14303 non-null  int64
 6   households          14303 non-null  int64
 7   median_income       14303 non-null  float64
 8   median_house_value  14303 non-null  int64
 9   ocean_proximity     14303 non-null  object
dtypes: float64(4), int64(5), object(1)
memory usage: 1.2+ MB

In [29]:
df = int(house_dropna_70['housing_median_age'].quantile(0.25))
print(df)

19

In [47]:
# 01. 주어진 캘리포니아 주택 데이터에서 결측치가 있는 경우 해당 데이터 행을 제외하고 첫 번째 행부터 순서대로 70% 데이터를 추출하여 "housing_median_age"변수의
# Q1(1사분위)값을 정수로 출력하시오.
import pandas as pd
house = pd.read_csv(r"D:\2025 단축키 빅데이터분석기사_파이썬\작업형 제1유형\data\housing.csv")
house_drop = house.dropna()
house_drop_70 = house_drop[:int(len(house_drop)*0.7)]
df = int(house_drop_70['housing_median_age'].quantile(0.25))
print(df)

19

In [49]:
import pandas as pd
house = pd.read_csv(r"D:\2025 단축키 빅데이터분석기사_파이썬\작업형 제1유형\data\housing.csv")
print(house.head(3))
house.shape

   longitude  latitude  housing_median_age  total_rooms  total_bedrooms  \
0    -122.23     37.88                  41          880           129.0
1    -122.22     37.86                  21         7099          1106.0
2    -122.24     37.85                  52         1467           190.0

   population  households  median_income  median_house_value ocean_proximity
0         322         126         8.3252              452600        NEAR BAY
1        2401        1138         8.3014              358500        NEAR BAY
2         496         177         7.2574              352100        NEAR BAY

(20640, 10)

In [51]:
house_80 = house.iloc[:int(len(house)*0.8)]
house_80.shape

(16512, 10)

In [53]:
house_80.isna().sum()

longitude               0
latitude                0
housing_median_age      0
total_rooms             0
total_bedrooms        159
population              0
households              0
median_income           0
median_house_value      0
ocean_proximity         0
dtype: int64

In [55]:
df1 = house_80['total_bedrooms'].std()
df1

435.900577052527

In [61]:
df2 = house_80.fillna(house_80.median(numeric_only=True))
df3 = df2['total_bedrooms'].std()
print(df3)

433.9254297608813

In [63]:
ans = abs(df1 - df3)
print(round(ans, 2))

1.98

In [81]:
# 02. 주어진 캘리포니아 주택 데이터에서 첫번째 행부터 순서대로 80%까지의 데이터를 추출한 후 'total_bedrooms'변수의 결측값(NA)을 'total_bedrooms'변수의 중앙값으로
# 대체하고 대체 전의 'total_bedrooms'변수의 표준편차와 대체 후의 표준편차의 차이의 절대값을 구하시오.
# (답안은 소수점 3째 자리에서 반올림해서 소수점 2째 자리까지 출력하시오.)
import pandas as pd
house = pd.read_csv(r"D:\2025 단축키 빅데이터분석기사_파이썬\작업형 제1유형\data\housing.csv")
house_80 = house[:int(len(house)*0.8)]
bef = house_80['total_bedrooms'].std()
df1 = house_80.fillna(house_80.median(numeric_only=True))
aft = df1['total_bedrooms'].std()
ans = abs(bef - aft)
print(round(ans, 2))

1.98

In [83]:
import pandas as pd
titanic = pd.read_csv(r"D:\2025 단축키 빅데이터분석기사_파이썬\작업형 제1유형\data\train_df1.csv")
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [85]:
titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [89]:
df = titanic.isna().sum()
df.max()

687

In [91]:
df.argmax()

10

In [93]:
df.index[10]

'Cabin'

In [95]:
df1 = df/len(titanic)
print(df1)

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [99]:
df1 = pd.DataFrame(df1)
df1.sort_values(by=0, ascending=False)

                    0
Cabin        0.771044
Age          0.198653
Embarked     0.002245
PassengerId  0.000000
Survived     0.000000
Pclass       0.000000
Name         0.000000
Sex          0.000000
SibSp        0.000000
Parch        0.000000
Ticket       0.000000
Fare         0.000000

In [101]:
df2 = df1.sort_values(by=0, ascending=False)
print(df2.index[0])

Cabin

In [133]:
# 03. 타이타닉 데이터의 컬럼 중 빈값 또는 결측치를 구하고 결측값 비율이 가장 높은 컬럼명을 출력하시오.
import pandas as pd
titanic = pd.read_csv(r"D:\2025 단축키 빅데이터분석기사_파이썬\작업형 제1유형\data\train_df1.csv")
df = titanic.isna().sum()
#df.max()
#df.argmax()
df1 = df/len(df)
#df.index[df.argmax()]
df1 = pd.DataFrame(df1)
df1 = df1.sort_values(by=0, ascending=False)
ans = df1.index[0]
print(ans)

Cabin